In [1]:
import pandas as pd

In [7]:
df_adv = pd.read_excel('AdventureWorks.xlsx')
df_aracaju = pd.read_excel('Aracaju.xlsx')
df_fortaleza = pd.read_excel('Fortaleza.xlsx')
df_natal = pd.read_excel('Natal.xlsx')
df_recife = pd.read_excel('Recife.xlsx')
df_salvador = pd.read_excel('Salvador.xlsx')

In [15]:
df_natal.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [22]:
df_adv.isnull().sum()

Data Venda        0
Data Envio        0
ID Loja           0
ID Produto        0
ID Cliente        0
No. Venda         0
Custo Unitário    0
Preço Unitário    0
Quantidade        0
Valor Desconto    0
Valor Venda       0
Produto           0
Fabricante        0
Marca             0
Classe            0
Cor               0
dtype: int64

In [16]:
#juntando todos arquivos
df_vendas = pd.concat([df_aracaju, df_fortaleza, df_natal, df_recife, df_salvador])

In [17]:
df_vendas

       Cidade       Data  Vendas  LojaID  Qtde
0     Aracaju 2018-01-01  142.00    1520     1
1     Aracaju 2018-01-01   14.21    1522     6
2     Aracaju 2018-01-01   71.55    1520     1
3     Aracaju 2018-01-01    3.01    1521     7
4     Aracaju 2018-01-01   24.51    1522     8
..        ...        ...     ...     ...   ...
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

[894 rows x 5 columns]

In [19]:
df_vendas['LojaID'] = df_vendas['LojaID'].astype('object') # alterando o tipo de dados do LojaID para object porque não será utilizado nenhum calculo

In [20]:
df_vendas.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

In [21]:
df_vendas.isnull().sum() # verificadno se tem valores nulos

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

se houvesse dados nulos precisaria tomar alguma decisão como excluir as linhas, substituir por zero ou outro valor
nessa opção esta substituindo valores nulos na coluna vendas pelo valor medio das vendas
df_vendas['Vendas'].fillna(df_vendas['Vendas'].mean(), inplace=True)

nessa opção esta substituindo valores nulos na coluna vendas pelo valor 0
df_vendas['Vendas'].fillna(0, inplace=True)

nessa opção esta excluindo as linhas nulas
df_vendas.dropna(Inplace=True)  atenção que esse processo pode zer perigoso dependendo do projeto

nessa opção esta excluindo as linhas nulas da coluna Vendas
df_vendas.dropna(subset-['Vendas'], Inplace=True)

In [23]:
#Criando nova coluna de Receita contendo o valor da venda multiplicado pela quantidade
df_vendas['Receita'] = df_vendas['Vendas'].mul(df_vendas['Qtde'])

In [24]:
df_vendas

       Cidade       Data  Vendas LojaID  Qtde  Receita
0     Aracaju 2018-01-01  142.00   1520     1   142.00
1     Aracaju 2018-01-01   14.21   1522     6    85.26
2     Aracaju 2018-01-01   71.55   1520     1    71.55
3     Aracaju 2018-01-01    3.01   1521     7    21.07
4     Aracaju 2018-01-01   24.51   1522     8   196.08
..        ...        ...     ...    ...   ...      ...
235  Salvador 2019-01-03   41.84   1034     1    41.84
236  Salvador 2019-01-03  126.29   1035     3   378.87
237  Salvador 2019-01-03   38.06   1036     3   114.18
238  Salvador 2019-01-03  139.64   1035     1   139.64
239  Salvador 2019-01-03  161.41   1037     3   484.23

[894 rows x 6 columns]

levantando o maio valor de receita
df_vendas['Receita'].max()

levantando o menor valor de receita
df_vendas['Receita'].min()

In [25]:
df_vendas.nlargest(3, 'Receita') # Mostra os dados das 3 maiores Receitas

   Cidade       Data  Vendas LojaID  Qtde  Receita
7   Natal 2019-03-18   886.0    853     4   3544.0
51  Natal 2018-01-21   859.0    852     4   3436.0
55  Natal 2019-01-08   859.0    854     4   3436.0

In [26]:
df_vendas.nsmallest(3, 'Receita') # Mostra os dados das 3 menores Receitas

      Cidade       Data  Vendas LojaID  Qtde  Receita
118  Aracaju 2018-01-01    3.34   1522     1     3.34
65    Recife 2019-01-01    4.01    981     1     4.01
92     Natal 2019-01-02    4.57   1035     1     4.57

In [27]:
#AAagrupamento de Receita por cidade
df_vendas.groupby('Cidade')['Receita'].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [29]:
df_vendas.sort_values('Receita', ascending=False) # ordenando os valores de Receita por ordem decrescente

       Cidade       Data  Vendas LojaID  Qtde  Receita
7       Natal 2019-03-18  886.00    853     4  3544.00
55      Natal 2019-01-08  859.00    854     4  3436.00
51      Natal 2018-01-21  859.00    852     4  3436.00
30      Natal 2018-10-02  856.00    853     4  3424.00
41      Natal 2018-05-20  835.00    852     4  3340.00
..        ...        ...     ...    ...   ...      ...
95      Natal 2019-01-02    5.13   1035     1     5.13
92      Natal 2019-01-02    4.57   1035     1     4.57
92   Salvador 2019-01-01    4.57   1035     1     4.57
65     Recife 2019-01-01    4.01    981     1     4.01
118   Aracaju 2018-01-01    3.34   1522     1     3.34

[894 rows x 6 columns]